{
	"name": "TERPO-Reborn 1.7.18",
	"description": "[img]https://i.imgur.com/9dc5DGM.png[/img]\n\n[img]https://i.imgur.com/j8TJVux.png[/img]\n\nI want to preface this description by saying that TERPO-Reborn is first and foremost the original server mod for the [i]The Exiled-RP PvP[/i] server and that the main goal of the mod is to conveniently package several quality-of-life features for [i]our[/i] server into a single mod. Please keep that in mind while going through the following list of all those features and decide for yourself if it's still of interest for your server. \n\n[img]https://i.imgur.com/YThkrS9.png[/img]\n\n[h1]Alternate Character Slot[/h1]\n\n[b]Important:[/b] This part of the mod will not work in single player games and unless an additional component is installed by the server admin. See Admin Information below for more information on this!\n\n\n[img]https://i.imgur.com/OVHFbf5.png[/img]\n\nThis allows players to have up to nine characters per account on a single server. The total number of slots as well as its distribution among normal players and admins can be adjusted by the server administration team.\n\n\n[img]https://i.imgur.com/59fZjZU.png[/img]\n\nThe config menu as well as the slots can be accessed via in-game [b][Esc][/b] key menu and clicking on one of the right hand buttons. The slot buttons will log the player out to the main menu just like the normal exit button would have done. However at the next login the player will login on that character slot.\n\n\n[img]https://i.imgur.com/1j4mHuy.png[/img]\n\nThe above image illustrates how characters are stored in those slots and how changing the number of player character and admin slots affects them. It is important to understand that changing those settings will not [i]create[/i] or [i]remove[/i] characters but merely changes who can access them!\n\nNotice: Due to the nature of those slots and how the game was designed, certain other game or mod features may not work as expected (e.g. Pippi ranks, the /sethome and /home commands apply to the account, not to the character).\n\n\n[h1]Solely Cosmetic Functionality of Warpaints[/h1]\n\nThis feature removes the statistical bonuses for warpaints, thus allowing them to be optional in the customization of a character. Instead, the points have been reallocated to a character's base Attribute points. Characters stand to gain thirty additional Attribute points throughout the leveling process (up to level 60), increasing the base 390 Attribute points to 420.\n\nThese points are not awarded retroactively and may have to be set manually if the mod is not installed on a fresh server.\n\n[h1]Additional Stat Bonus to Flawless Weaponry[/h1]\n\nThis feature adds greater value to flawless, epic weapons, thus making them more interesting alternatives to legendary weapons. The mod grants most of them +3 in an appropriate stat. This will likely still leave them worse than most legendaries but closes the gap between both types of weaponry.\n\n[h1]Hiding Additional Feats and Recipes[/h1]\n\nTERPO-Reborn hides the Cartographer feat, thus preventing players from crafting a map room. This allows the map room to only be spawned by server administration. However, players who already have the feat will not have it removed from them by the mod.\nIn addition, the following feats are hidden using the same mechanism of Cartographer: \n[list]\n[*] Shadows of Skelos feats:\n[list]\n[*] Skelos Collector\n[*] Garments Collector \n[*] Arms Collector\n[*] Relic Collector\n[/list] \n[*] Dude's Delightful Decorations feat:\n[list]\n[*] Wandering Wizard \n[/list]\n[*] Warsong RP Mod feat:\n[list]\n[*] Legendary Transmuter\n[/list]\n[/list]\n\nThis feature is geared towards the needs of the mod's home server and can safely be ignored by server admins that do not use any of the listed mods.\n\n[h1]Additional Items[/h1]\n\nThe TERPO-Reborn mod adds a hide rug decor item [i](\"Bed - Hide\")[/i] that can be used as a bed to bind yourself to. It also adds a few inventory items designed that are spawnable by administrators and only meant to be used as currency, quest items, keys for egress doors, etc. [i](\"Guilder\", \"Large, Undead Finger\", \"Temple of the Four Winds Key\" and \"Crown of the Ancestor\")[/i]\n\n\n[img]https://i.imgur.com/sG8DUm3.png[/img]\n\n[h1]Nerf to Yog's Touch[/h1]\n\nThis mod reduces the armor penetration value from 40% to 13%. Should the vanilla game seek to further reduce the armor penetration value of the weapon, this change may be removed to adjust depending upon need. This way, other weapons and styles are viable against the Yog's Touch. \nThe nerf is not applied to those Yog's Touch axes that have been modified with a kit that changes the armor penetration value. These axes would need to be replaced manually.\n\n\n[h1]Dragon Bone Arrow Recipe Fix[/h1]\n\nThis feature increases the Dragon Bone Arrow crafting to a stack of ten arrows as opposed to the prior output of a single arrow to be consistent with vanilla arrow production. \n\n[h1]Rcon Commands[/h1]\n\nAll TERPO Rcon commands start with the leading keyword \"TERPO\" followed by the actual command (e.g. TERPO getTime). Commands currently available are:\n[list]\n[*] getTime (returns the current server time in 24h [HH:MM:SS] format)\n[*] setTime <time> (set the current server time in 24h [HH:MM:SS] format)[/list]\nMore commands that will allow manual tracking and maintaining of the player slots are currently being tested and might be added in future updates.\n\n\n[img]https://i.imgur.com/wd2cjLV.png[/img]\n\nIn order for this mod to work server admins need to install an SQL trigger to the [b]game.db[/b] file of the server. \nThis trigger causes the database to react to TERPO-Reborn entries that are created when the user selects the desired character slot. This is what allows the selection of the additional character slot to make you login on that slot. If the trigger is not installed, nothing will occur when the alternative character slot buttons are selected by a player.\n\nThe trigger script can be downloaded [url=https://drive.google.com/file/d/1hDEsI66EUr4jdPa1J_yU7coV0GVa4b1T/view?usp=sharing]here[/url]\n\n[h1]Trigger Installation[/h1]\n\n[b]Important:[/b] Do not try and install the trigger while the server is running. Stop the server and run the trigger while the server is down. \n\nIf the Conan Exiles server runs on a dedicated machine with root access, copy [b]addtrigger.bat[/b] into the saved folder; backup the [b]game.db[/b], then run [b]addtrigger.bat[/b]. \nIf the server runs on a host that does not provide the owner with root access, the owner must download the [b]game.db[/b] and [b]sqlite3.exe[/b] files, and install the trigger locally.  \nTo do so:\n\n[list=1]\n[*] Download [b]game.db[/b] and [b]sqlite3.exe[/b] (that is provided upon server installation and should be in the same folder).\n[*] Copy a backup of [b]game.db[/b] to a safe location.\n[*] Place [b]game.db, sqlite3.exe[/b] and [b]addtrigger.bat[/b] in the same local folder.\n[*] Run the [b]addtrigger.bat[/b] script. This will add the trigger to that [b]game.db[/b].\n[*] Upload the changed [b]game.db[/b] back to the saved folder.\n[/list]\n\n[h1]Compatibility[/h1]\n\nAny mod that changes the levels or how many stat points players gain per level, as well as anything modifying the weapons directly affected by the mod (as per feature list above), will have to be loaded after TERPO-Reborn to ensure it's running fine.\n\n[h2]For Modders[/h2]\nTemplate ID range 8469XXXX.\n\n\n[img]https://i.imgur.com/ePAtMqi.png[/img]\n\n\n[img]https://i.imgur.com/OUyQrAu.png[/img]\n                              [b]Questions? Contact Arinoth#4701 on our [url=https://discord.gg/87AX98Y]Discord[/url][/b]\n\n[img]https://i.imgur.com/qZpedDO.png[/img]\nshadowCMD\nTesterle\nFoxcat\nLeadBucket\nIndustry13\nCodeine",
	"changeNote": "- added a lot of new RR items\n- blocked a few unimmersive items\n- unblocked a few no longer used items",
	"author": "Midnight",
	"authorUrl": "",
	"versionMajor": 1,
	"versionMinor": 7,
	"versionBuild": 18,
	"bRequiresLoadOnStartup": false,
	"steamPublishedFileId": "1683899944",
	"steamTestLivePublishedFileId": "3030453469",
	"steamVisibility": 0,
	"folderName": "TERPO-Reborn",
	"revisionNumber": 1043755,
	"snapshotId": 42715,
	"fileSize": -2
}